#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.auth: Refreshing state... [id=none]
data.aws_availability_zones.available: Reading...
aws_kms_key.encrytion_secret: Refreshing state... [id=49c814dd-0c0f-4e8d-8dc1-4e4b5f688166]
aws_vpc.this: Refreshing state... [id=vpc-0aee610d9ee2f5056]
aws_kms_key.encrytion_rest: Refreshing state... [id=d25d563f-9511-4831-9aee-0823f480e665]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_secretsmanager_secret.elasticache_auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-4-elasticache-auth-mcI2Ab]
aws_secretsmanager_secret_version.auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:app-4-elasticache-auth-mcI2Ab|E26C2D46-63C2-4059-A159-D2C53378DE51]
aws_iam_policy.secret_manager_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-4-secret-read-policy]
aws_route_table.private[1]: Refreshing state... [id=rtb-09c463d4787f20931]
aws_route_table.private[0]: Refreshing state... [id=rtb-00fd94662b273fa5f]
aws_route_table.private[2]: Refreshing state... [id=rtb-0be19402a8902cddc]
aws_default_security_group.default: Refreshing state... [id=sg-017656e5a4e187b27]
aws_subnet.private[1]: Refreshing state... [id=subnet-00445199ef90108e3]
aws_route_table.public: Refreshing state... [id=rtb-07a879baced138b59]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d793fee34548d46b]
aws_security_group.elasticache: Refreshing state... [id=sg-042c8552097212094]
aws_subnet.private[2]: Refreshing state... [id=subnet-052cb9788e3699e42]
aws_subnet.public[0]: Refreshing state... [id=subnet-01504aaf919b844a2]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07474438f8d7717f5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a3cfb9c7b6d62162]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=app-4-cache-subnet]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ec28b2c44b0623b5]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049a33ab4984be2a1]
aws_elasticache_replication_group.app4: Refreshing state... [id=app-4-redis-cluster]
aws_ssm_parameter.elasticache_port: Refreshing state... [id=/elasticache/app-4/app-4-redis-cluster/port]
aws_ssm_parameter.elasticache_ep: Refreshing state... [id=/elasticache/app-4/app-4-redis-cluster/endpoint]
aws_iam_policy.ssm_parameter_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-4-ssm-parameter-read-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.engine_log will be created
  + resource "aws_cloudwatch_log_group" "engine_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "d25d563f-9511-4831-9aee-0823f480e665"
      + name              = "/elasticache/app-4-redis-cluster/engine-log"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
    }

  # aws_cloudwatch_log_group.slow_log will be created
  + resource "aws_cloudwatch_log_group" "slow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "d25d563f-9511-4831-9aee-0823f480e665"
      + name              = "/elasticache/app-4-redis-cluster/slow-log"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-redis-tf"
        }
    }

  # aws_elasticache_replication_group.app4 will be updated in-place
  ~ resource "aws_elasticache_replication_group" "app4" {
        id                             = "app-4-redis-cluster"
        tags                           = {}
        # (32 unchanged attributes hidden)

      + log_delivery_configuration {
          + destination      = "/elasticache/app-4-redis-cluster/engine-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/elasticache/app-4-redis-cluster/slow-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*